vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE316_DFP.pdsc
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="device_id.MCXE316.internal_condition">
      <accept Dname="MCXE316MLF" Dvendor="NXP:11"/>
      <accept Dname="MCXE316MPA" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.silicon_id.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MCXE316, component.silicon_id_mcxe31x, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MCXE316, component.silicon_id_mcxe31x, driver.common.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MCXE316, component.silicon_id_mcxe31x.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=device_id=MCXE316, component.silicon_id_mcxe31x.internal_condition">
      <accept condition="allOf.anyOf=device_id=MCXE316, component.silicon_id_mcxe31x.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXE316, component.silicon_id_mcxe31x.internal_condition">
      <require condition="anyOf.device_id=MCXE316.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxe31x"/>
    </condition>
    <condition id="anyOf.device_id=MCXE316.internal_condition">
      <accept condition="device_id.MCXE316.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imx8.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imx93.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt10xx.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt1170.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt1180.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_mcxe31x.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_mcxn.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_rw610.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_scfw.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MCXE316.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MCXE316.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.pit_adapter, driver.pit, component.lists, driver.common, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.pit_adapter, driver.pit, component.lists, driver.common, device=MCXE316.internal_condition">
      <require condition="anyOf.allOf=component.pit_adapter, driver.pit.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXE316.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.pit_adapter, driver.pit.internal_condition">
      <accept condition="allOf.component.pit_adapter, driver.pit.internal_condition"/>
    </condition>
    <condition id="allOf.component.pit_adapter, driver.pit.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MCXE316.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MCXE316.internal_condition"/>
    </condition>
