vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE316_DFP.pdsc
    <condition id="device.MCXE316_flash.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXE316.internal_condition">
      <require condition="device_id.MCXE316.internal_condition"/>
    </condition>
    <condition id="device_ids.MCXE316.internal_condition">
      <accept Dname="MCXE316MLF" Dvendor="NXP:11"/>
      <accept Dname="MCXE316MPA" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=MCXE316.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.MCXE316.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=MCXE316.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.MCXE316.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=MCXE316.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.MCXE316.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.device_id=MCXE316, driver.common, driver.siul2, driver.clock, driver.memory, component.lpuart_adapter, CMSIS_Include_core_cm, device.CMSIS, device.system, device.startup, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXE316, driver.common, driver.siul2, driver.clock, driver.memory, component.lpuart_adapter, CMSIS_Include_core_cm, device.CMSIS, device.system, device.startup, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require condition="device_id.MCXE316.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="Siul2"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXE316_header"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXE316_system"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require condition="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <accept condition="allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition"/>
      <accept condition="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config"/>
    </condition>
    <condition id="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MCXE316.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXE316_system"/>
      <require condition="device.MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, iar, mdk.condition_id">
      <require condition="toolchains.armgcc, iar, mdk.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, iar, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="IAR"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MCXE316.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXE316_header"/>
      <require condition="device.MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.bctu.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXE316.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.cache_armv7_m7.condition_id">
      <require condition="allOf.driver.common, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.camera-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXE316.internal_condition"/>
    </condition>
