vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE316_DFP.pdsc
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXE316, device.RTE, device_id=MCXE316, driver.lpuart_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXE316, device.RTE, device_id=MCXE316, driver.lpuart_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpuart, device_id=MCXE316.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXE316.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpuart, device_id=MCXE316.internal_condition">
      <accept condition="allOf.driver.lpuart, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart, device_id=MCXE316.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.cmu_fc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.cmu_fm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm7f.condition_id">
      <require condition="cores.cm7f.internal_condition"/>
    </condition>
    <condition id="cores.cm7f.internal_condition">
      <accept Dcore="Cortex-M7"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.dbi.condition_id">
      <require condition="allOf.driver.video-common, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.dbi_flexio_edma.condition_id">
      <require condition="allOf.driver.edma4, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, device=MCXE316.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-dbi.condition_id">
      <require condition="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MCXE316.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require condition="device.MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-ssd1963.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MCXE316.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963"/>
      <require condition="device.MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.dcm.condition_id">
      <require condition="allOf.driver.common, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.dcm_gpr.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.display-adv7535.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.driver.display-common, driver.video-i2c, device=MCXE316.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c"/>
      <require condition="device.MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.display-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.display-it6161.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.display-it6263.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.display-sn65dsi83.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.eMIOS.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.edma4.condition_id">
      <require condition="allOf.driver.edma_soc, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma_soc, device_id=MCXE316.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma_soc"/>
      <require condition="device_id.MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.edma_soc.condition_id">
      <require condition="allOf.device=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.flash_c40.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.flexcan.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE316.internal_condition"/>
    </condition>
    <condition id="driver.flexcan_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexcan, device=MCXE316.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexcan, device=MCXE316.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan"/>
      <require condition="device.MCXE316.internal_condition"/>
    </condition>
