vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE316_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter" Cversion="2.2.0" condition="component.da7212_adapter.condition_id">
      <description>Component da7212 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/da7212/fsl_codec_da7212_adapter.h" projectpath="codec/port/da7212"/>
        <file category="sourceC" name="components/codec/port/da7212/fsl_codec_da7212_adapter.c" projectpath="codec/port/da7212"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/da7212/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_AT25Fxxxx" Cversion="1.0.0" condition="component.eeprom_AT25Fxxxx.condition_id">
      <description>Component eeprom_at25fxxxx</description>
      <files>
        <file category="doc" name="components/extern_flash/component.eeprom_AT25Fxxxx_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_AT45DBxxxx" Cversion="1.0.0" condition="component.eeprom_AT45DBxxxx.condition_id">
      <description>Component eeprom_at45dbxxxx</description>
      <files>
        <file category="doc" name="components/extern_flash/component.eeprom_AT45DBxxxx_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_InternalFlash" Cversion="1.0.0" condition="component.eeprom_InternalFlash.condition_id">
      <description>Component eeprom_internalflash</description>
      <files>
        <file category="doc" name="components/extern_flash/component.eeprom_InternalFlash_dummy.txt"/>
      </files>
    </component>
    <component Cclass="ele_hseb" Cgroup="ele_hseb" Cversion="1.0.0" condition="component.ele_hseb.condition_id">
      <description>Component ele_hseb</description>
      <files>
        <file category="doc" name="components/ele_hseb/component.ele_hseb_dummy.txt"/>
      </files>
    </component>
    <component Cclass="ele_hseb_framework" Cgroup="ele_hseb" Cversion="1.0.0" condition="component.ele_hseb_framework.condition_id">
      <description>Component ele_hseb_framework</description>
      <files>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_common_test.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_aead.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_aead.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_attrs.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_attrs.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_cipher.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_cipher.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_cmac_with_counter.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_cmac_with_counter.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_ecc.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_ecc.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_format_key_catalogs.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_format_key_catalogs.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_hash.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_hash.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_impex_stream.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_impex_stream.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_import_key.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_import_key.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_kdf.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_kdf.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_mac.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_mac.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_monotonic_counters.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_monotonic_counters.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_rng.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_rng.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_rsa_cipher.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_rsa_cipher.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_sign.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_sign.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_utils.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_utils.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_hse/host_compiler_api.h" projectpath="component/ele_hseb/framework/host_hse"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_hse/hse_host.c" projectpath="component/ele_hseb/framework/host_hse"/>
        <file category="header" name="components/ele_hseb/framework/host_hse/hse_host.h" projectpath="component/ele_hseb/framework/host_hse"/>
        <file category="header" name="components/ele_hseb/framework/host_hse/hse_tracing.h" projectpath="component/ele_hseb/framework/host_hse"/>
        <file category="header" name="components/ele_hseb/framework/host_hse/hse_b/hse_default_config.h" projectpath="component/ele_hseb/framework/host_hse/hse_b"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_keymgmt/hse_keys_allocator.c" projectpath="component/ele_hseb/framework/host_keymgmt"/>
        <file category="header" name="components/ele_hseb/framework/host_keymgmt/hse_keys_allocator.h" projectpath="component/ele_hseb/framework/host_keymgmt"/>
        <file category="include" name="components/ele_hseb/"/>
        <file category="include" name="components/ele_hseb/framework/host_crypto_helper/"/>
        <file category="include" name="components/ele_hseb/framework/host_hse/"/>
        <file category="include" name="components/ele_hseb/framework/host_hse/hse_b/"/>
        <file category="include" name="components/ele_hseb/framework/host_keymgmt/"/>
      </files>
    </component>
