vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE316_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXE316_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXE316_cmsis</description>
      <files>
        <file category="header" name="devices/MCXE316/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXE316/MCXE316.h" projectpath="device"/>
        <file category="header" name="devices/MCXE316/MCXE316_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXE316/MCXE316_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_ADC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_BCTU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_CAN.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_CMU_FC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_CMU_FM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_CONFIGURATION.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_CRC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_DCM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_DCM_GPR.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_DMA.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_DMAMUX.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_EIM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_EMIOS.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_ERM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_FCCU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_FIRC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_FLASH.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_FLEXIO.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_FXOSC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_INTM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_JDC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_LCU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_LPCMP.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_LPI2C.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_LPSPI.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_LPUART.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_MCM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_MC_CGM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_MC_ME.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_MC_RGM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_MDM_AP.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_MSCM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_MU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_PFLASH.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_PIT.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_PLL.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_PMC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_PRAMC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_RTC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_SDA_AP.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_SIRC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_SIUL2.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_STCU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_STM.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_SWT.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_TEMPSENSE.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_TRGMUX.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_TSPC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_VIRT_WRAPPER.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_WKPU.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_XBIC.h" projectpath="device/periph5"/>
        <file category="header" name="devices/MCXE316/periph5/PERI_XRDC.h" projectpath="device/periph5"/>
        <file category="include" name="devices/MCXE316/"/>
        <file category="include" name="devices/MCXE316/periph5/"/>
      </files>
    </component>
