vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE316_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-dbi" Cversion="1.0.0" condition="driver.dc-fb-dbi.condition_id">
      <description>Driver dc-fb-dbi</description>
      <RTE_Components_h>
#ifndef MCUX_DBI_LEGACY
#define MCUX_DBI_LEGACY 0
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/video/display/dc/dbi/fsl_dc_fb_dbi.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/dbi/fsl_dc_fb_dbi.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/dbi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-ssd1963" Cversion="1.0.2" condition="driver.dc-fb-ssd1963.condition_id">
      <description>Driver dc-fb-ssd1963</description>
      <files>
        <file category="header" name="components/video/display/dc/ssd1963/fsl_dc_fb_ssd1963.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/ssd1963/fsl_dc_fb_ssd1963.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/ssd1963/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dcm" Cversion="2.0.1" condition="driver.dcm.condition_id">
      <description>DCM Driver</description>
      <files>
        <file category="header" name="devices/MCXE316/drivers/fsl_dcm.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE316/drivers/fsl_dcm.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE316/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dcm_gpr" Cversion="2.0.0" condition="driver.dcm_gpr.condition_id">
      <description>DCM_GPR Driver</description>
      <files>
        <file category="header" name="devices/MCXE316/drivers/fsl_dcm_gpr.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE316/drivers/fsl_dcm_gpr.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE316/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-adv7535" Cversion="1.0.1" condition="driver.display-adv7535.condition_id">
      <description>Driver display-adv7535</description>
      <files>
        <file category="header" name="components/video/display/adv7535/fsl_adv7535.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/adv7535/fsl_adv7535.c" projectpath="video"/>
        <file category="include" name="components/video/display/adv7535/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-common" Cversion="1.0.0" condition="driver.display-common.condition_id">
      <description>Driver display-common</description>
      <files>
        <file category="header" name="components/video/display/fsl_display.h" projectpath="video"/>
        <file category="include" name="components/video/display/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-it6161" Cversion="1.0.0" condition="driver.display-it6161.condition_id">
      <description>Driver display-it6161</description>
      <files>
        <file category="header" name="components/video/display/it6161/fsl_it6161.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/fsl_it6161.c" projectpath="video"/>
        <file category="header" name="components/video/display/it6161/hdmi_tx.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/hdmi_tx.c" projectpath="video"/>
        <file category="header" name="components/video/display/it6161/mipi_rx.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/mipi_rx.c" projectpath="video"/>
        <file category="include" name="components/video/display/it6161/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-it6263" Cversion="1.0.1" condition="driver.display-it6263.condition_id">
      <description>Driver display-it6263</description>
      <files>
        <file category="header" name="components/video/display/it6263/fsl_it6263.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6263/fsl_it6263.c" projectpath="video"/>
        <file category="include" name="components/video/display/it6263/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-sn65dsi83" Cversion="1.0.0" condition="driver.display-sn65dsi83.condition_id">
      <description>Driver display-sn65dsi83</description>
      <files>
        <file category="header" name="components/video/display/sn65dsi83/fsl_sn65dsi83.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/sn65dsi83/fsl_sn65dsi83.c" projectpath="video"/>
        <file category="include" name="components/video/display/sn65dsi83/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.3" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/MCXE316/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE316/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE316/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="emios" Cversion="2.0.0" condition="driver.eMIOS.condition_id">
      <description>eMIOS Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE316/drivers/fsl_emios.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE316/drivers/fsl_emios.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE316/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.10.6" condition="driver.edma4.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MCXE316/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="header" name="devices/MCXE316/drivers/fsl_edma_core.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE316/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE316/drivers/"/>
      </files>
    </component>
